# __Handling Missing Data__

In [1]:
import pandas as pd
import numpy as  np

In [2]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

---
## DropNA
    dropna(): Drops Rows that contains NaN Values
    dropna(axis=1) : Drops Columns that contains NaN Values

In [3]:
df.dropna()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [4]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

##### How Parameter using to check if row contains NaN
    how=
    "any" : checks if row contains ANY NaN
    "all" : checks if row is full of NaN

In [5]:
df.dropna(how="any")

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [6]:
df.dropna(how="all")

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

##### Subset Parameter removes NaN from Particular columns
        subset=['ColName']

In [7]:
df.dropna(subset=['Age'])

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

##### Inplace Parameters save changes into Original 
    inplace=True

In [8]:
df.dropna(inplace=True)
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [9]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

#####  Thresh Parameter removes rows containing n number or NaN__
        thresh= n

In [10]:
df.dropna(thresh=1)

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 0 to 14
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       11 non-null     float64
 1   Name        11 non-null     object
 2   Dept        11 non-null     object
 3   Age         11 non-null     float64
 4   Salary      11 non-null     float64
 5   Experience  11 non-null     float64
dtypes: float64(4), object(2)
memory usage: 616.0+ bytes

----
## FillNa

In [12]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### fillna(data) : to fill NaN values with given data.
    fillna({ 'ColName': Data }) : to fill data in particular column

In [13]:
df.fillna('python')

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [14]:
df.fillna({"Age":0,"Experience":0})

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### Method Parameter: Used to fill data of last row or next row
    method="ffill" : For Forward Filling (fill data same as previous row)
    method="bfill" : For Backward Filling (fill data same as next row)

#### __obj.ffill() & obj.bfill__ can also be used instead.

In [15]:
# df.fillna(method="ffill")
df.ffill()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [16]:
# df.fillna(method="bfill")
df.bfill()

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

In [17]:
df

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

### __axis=1 : for filling data of Columns__

In [18]:
# f-fill
# df.fillna(method='ffill',axis=1)
# df.ffill(axis=1)

#b-fill
# df.fillna(method='bfill',axis=1)
# df.bfill(axis=1)

### Limit Parameter
    limit = n : fill data into column upto n limit

In [19]:
df.fillna('python',limit=1)

    EmpID    Name     Dept   Age   Salary  Experience
0   101.0     Ali       IT  22.0  45000.0         1.0
1   102.0    Sara       HR  29.0  52000.0         5.0
2   103.0   Ahmed       IT  24.0  48000.0         2.0
3   104.0    Zara  Finance  31.0  60000.0         7.0
4   105.0   Usman       HR  26.0  50000.0         3.0
5   106.0    Hina       IT  23.0  47000.0         1.0
6   107.0   Bilal       HR  28.0  55000.0         4.0
7   108.0    Nida       it  30.0  62000.0         6.0
10  101.0     Ali       IT  22.0  45000.0         1.0
11  112.0   Tariq    Sales  45.0  70000.0        15.0
14  114.0  Shahid       HR  22.0  55000.0         1.0

----
## Replace

In [20]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

### Replace function  : to replace any/all value within data set
    df.replace(to_replace='Ali', value='Raza')
    to_replace= : data to be replaced
    value= : replacement value

In [21]:
# df.replace(to_replace='Ali',value='Raza')
df.replace(to_replace=[1,2,3,4,5,6,7],value=20)

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0        20.0
1   102.0    Sara         HR  29.0  52000.0        20.0
2   103.0   Ahmed         IT  24.0  48000.0        20.0
3   104.0    Zara    Finance  31.0  60000.0        20.0
4   105.0   Usman         HR  26.0  50000.0        20.0
5   106.0    Hina         IT  23.0  47000.0        20.0
6   107.0   Bilal         HR  28.0  55000.0        20.0
7   108.0    Nida         it  30.0  62000.0        20.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN        20.0
10  101.0     Ali         IT  22.0  45000.0        20.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0        20.0

### Regex Parameter

In [22]:
df.replace('[A-Za-z]','python',regex=True)

,EmpID,Name,Dept,Age,Salary,Experience
0,101.0,pythonpythonpython,pythonpython,22.0,45000.0,1.0
1,102.0,pythonpythonpythonpython,pythonpython,29.0,52000.0,5.0
2,103.0,pythonpythonpythonpythonpython,pythonpython,24.0,48000.0,2.0
3,104.0,pythonpythonpythonpython,pythonpythonpythonpythonpythonpythonpython,31.0,60000.0,7.0
4,105.0,pythonpythonpythonpythonpython,pythonpython,26.0,50000.0,3.0
5,106.0,pythonpythonpythonpython,pythonpython,23.0,47000.0,1.0
6,107.0,pythonpythonpythonpythonpython,pythonpython,28.0,55000.0,4.0
7,108.0,pythonpythonpythonpython,pythonpython,30.0,62000.0,6.0
8,109.0,NaN,pythonpythonpythonpythonpythonpythonpython,NaN,58000.0,8.0
9,110.0,pythonpythonpythonpython,pythonpythonpythonpythonpythonpythonpythonpyth...,25.0,NaN,2.0
10,101.0,pythonpythonpython,pythonpython,22.0,45000.0,1.0
11,112.0,pythonpythonpythonpythonpython,pythonpythonpythonpythonpython,45.0,70000.0,15.0
12,113.0,pythonpythonpythonpythonpythonpython,pythonpython,21.0,55000.0,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN
14,114.0,pythonpythonpythonpythonpythonpython,pythonpython,22.0,55000.0,1.0

### Replace Data of Particular Column Using Dictionary

In [23]:
df.replace({"Name":'[A-Z]'},25,regex=True)

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\3211717003.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace({"Name":'[A-Z]'},25,regex=True)

    EmpID  Name       Dept   Age   Salary  Experience
0   101.0  25.0         IT  22.0  45000.0         1.0
1   102.0  25.0         HR  29.0  52000.0         5.0
2   103.0  25.0         IT  24.0  48000.0         2.0
3   104.0  25.0    Finance  31.0  60000.0         7.0
4   105.0  25.0         HR  26.0  50000.0         3.0
5   106.0  25.0         IT  23.0  47000.0         1.0
6   107.0  25.0         HR  28.0  55000.0         4.0
7   108.0  25.0         it  30.0  62000.0         6.0
8   109.0   NaN    Finance   NaN  58000.0         8.0
9   110.0  25.0  Marketing  25.0      NaN         2.0
10  101.0  25.0         IT  22.0  45000.0         1.0
11  112.0  25.0      Sales  45.0  70000.0        15.0
12  113.0  25.0         IT  21.0  55000.0         NaN
13    NaN   NaN        NaN   NaN      NaN         NaN
14  114.0  25.0         HR  22.0  55000.0         1.0

### Replace Data using Forward Filling and Backward Filling

### __Forward Filling__

In [24]:
df.replace(1,method='ffill')

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\1079361840.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(1,method='ffill')

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         3.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0         2.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         NaN

### __Backward Filling__

In [25]:
df.replace(1,method='bfill')

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\941624170.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(1,method='bfill')

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         IT  22.0  45000.0         5.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed         IT  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         IT  23.0  47000.0         4.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali         IT  22.0  45000.0        15.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon         IT  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

### Limit Parameter
    limit = n : fill data into column upto n limit

In [26]:
df.replace('IT',method="bfill",limit=1)

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\3969347521.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('IT',method="bfill",limit=1)

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed    Finance  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         HR  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali      Sales  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon        NaN  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

### Inplace Parameter 
     Save changes into original dataset

In [27]:
df.replace('IT',method="bfill",limit=1,inplace=True)

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\2618663320.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('IT',method="bfill",limit=1,inplace=True)

----
## Interpolate
    Fills missing values using patterns or trends in data.

In [28]:
df

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed    Finance  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         HR  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali      Sales  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon        NaN  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

In [29]:
df.interpolate()

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\4002874584.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed    Finance  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         HR  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali      Sales  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon        NaN  21.0  55000.0   10.333333
13  113.5     NaN        NaN  21.5  55000.0    5.666667
14  114.0  Shahid         HR  22.0  55000.0    1.000000

In [30]:
df.interpolate(axis=0) # For axis=1 all columns should have same dtype

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\2001427889.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(axis=0) # For axis=1 all columns should have same dtype

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed    Finance  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         HR  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali      Sales  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon        NaN  21.0  55000.0   10.333333
13  113.5     NaN        NaN  21.5  55000.0    5.666667
14  114.0  Shahid         HR  22.0  55000.0    1.000000

 # Pandas interpolate() Methods

| Method | Description | When to Use |
|------|------------|------------|
| `linear` | Fills NaN using straight-line interpolation between values (default) | General numeric data |
| `time` | Interpolates based on time index spacing | Time-series data with DatetimeIndex |
| `index` | Uses index values as x-coordinates | When index represents meaningful numeric order |
| `values` | Uses actual data values for interpolation | Rare, numeric-only cases |
| `nearest` | Fills NaN using nearest non-NaN value | When closest value matters |
| `zero` | Step-wise interpolation using zero-order spline | Discrete step data |
| `slinear` | Linear spline interpolation | Smoother than linear |
| `quadratic` | Second-order spline interpolation | Curved numeric trends |
| `cubic` | Third-order spline interpolation | Smooth curves (advanced) |
| `barycentric` | Polynomial interpolation using barycentric method | Mathematical datasets |
| `polynomial` | Polynomial interpolation (requires `order` parameter) | Controlled curve fitting |
| `spline` | Spline interpolation (requires `order`) | Advanced numerical data |
| `pchip` | Shape-preserving cubic interpolation | Avoids overshooting |
| `akima` | Akima spline interpolation | Noisy or uneven data |
| `pad` / `ffill` | Forward fill (previous value) | Sequential data |
| `backfill` / `bfill` | Backward fill (next value) | Reverse sequential data |

### Limit Parameter
    limit = n : fill data into column upto n limit

In [31]:
df.interpolate(limit=1)

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\1270544217.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit=1)

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed    Finance  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         HR  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali      Sales  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon        NaN  21.0  55000.0   10.333333
13  113.5     NaN        NaN  21.5  55000.0         NaN
14  114.0  Shahid         HR  22.0  55000.0    1.000000

### Limit Direction Parameter
        Direction in which limit applies.

In [32]:
df.interpolate(limit_direction='backward',limit=1)

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\2302535918.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_direction='backward',limit=1)

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed    Finance  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         HR  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali      Sales  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon        NaN  21.0  55000.0         NaN
13  113.5     NaN        NaN  21.5  55000.0    5.666667
14  114.0  Shahid         HR  22.0  55000.0    1.000000

### Limit Area Parameter 
         Area in which limit applies

In [33]:
df.interpolate(limit_area='outside')

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\1653127404.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(limit_area='outside')

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0         1.0
1   102.0    Sara         HR  29.0  52000.0         5.0
2   103.0   Ahmed    Finance  24.0  48000.0         2.0
3   104.0    Zara    Finance  31.0  60000.0         7.0
4   105.0   Usman         HR  26.0  50000.0         3.0
5   106.0    Hina         HR  23.0  47000.0         1.0
6   107.0   Bilal         HR  28.0  55000.0         4.0
7   108.0    Nida         it  30.0  62000.0         6.0
8   109.0     NaN    Finance   NaN  58000.0         8.0
9   110.0    Omer  Marketing  25.0      NaN         2.0
10  101.0     Ali      Sales  22.0  45000.0         1.0
11  112.0   Tariq      Sales  45.0  70000.0        15.0
12  113.0  Haroon        NaN  21.0  55000.0         NaN
13    NaN     NaN        NaN   NaN      NaN         NaN
14  114.0  Shahid         HR  22.0  55000.0         1.0

### Inplace Parameter 
     Save changes into original dataset

In [34]:
df.interpolate(inplace=True)
df

C:\Users\Professor\AppData\Local\Temp\ipykernel_13700\28687744.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(inplace=True)

    EmpID    Name       Dept   Age   Salary  Experience
0   101.0     Ali         HR  22.0  45000.0    1.000000
1   102.0    Sara         HR  29.0  52000.0    5.000000
2   103.0   Ahmed    Finance  24.0  48000.0    2.000000
3   104.0    Zara    Finance  31.0  60000.0    7.000000
4   105.0   Usman         HR  26.0  50000.0    3.000000
5   106.0    Hina         HR  23.0  47000.0    1.000000
6   107.0   Bilal         HR  28.0  55000.0    4.000000
7   108.0    Nida         it  30.0  62000.0    6.000000
8   109.0     NaN    Finance  27.5  58000.0    8.000000
9   110.0    Omer  Marketing  25.0  51500.0    2.000000
10  101.0     Ali      Sales  22.0  45000.0    1.000000
11  112.0   Tariq      Sales  45.0  70000.0   15.000000
12  113.0  Haroon        NaN  21.0  55000.0   10.333333
13  113.5     NaN        NaN  21.5  55000.0    5.666667
14  114.0  Shahid         HR  22.0  55000.0    1.000000